## 예제 1-10 내부 원소 처리 기준

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
# 1~10까지의 임의의 수를 3*3배열에 생성한다
np.random.randint(1,10,(3,3))

array([[2, 3, 3],
       [7, 7, 4],
       [9, 9, 4]])

In [8]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),
                    columns = list('ABC'))

In [9]:
df_1

   A  B  C
0  3  1  7
1  8  7  6
2  2  5  1

In [11]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),
                   columns  = list('CAB'))

In [12]:
df_2

   C  A  B
0  6  1  7
1  1  3  4
2  6  2  9

In [13]:
np.log(df_2)

          C         A         B
0  1.791759  0.000000  1.945910
1  0.000000  1.098612  1.386294
2  1.791759  0.693147  2.197225

In [18]:
# 열을 맞추어 계산한다 (A-A, B-B, C-C)
df_1 + df_2

    A   B   C
0   4   8  13
1  11  11   7
2   4  14   7

In [19]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)), columns = list('CB'))

In [20]:
df_3

   C  B
0  5  5
1  8  9
2  8  9

In [21]:
# 없는값은 NaN으로 처리된다
# df_1 (3행3열) df_2 (3행2열)
df_1 + df_3

    A   B   C
0 NaN   6  12
1 NaN  16  14
2 NaN  14   9